#!/usr/bin/env python3

import sys

filtering = ['보안', '클라우드', '윈도우', '데이터', '구글', '모바일', '서비스', 'pc', 'iot', '애플', '네트워크', '소프트웨어', '기업', 'it', '앱', '안드로이드', '비즈니스', '사용자', '기술', '시스템', '스마트폰', '인텔', '디지털', '아이폰', '마이크로소프트', '스토리지', '블록체인', '서피스', '성능', '개발', '배터리', 'ces', '게임', '글로벌', '스마트', '애플리케이션', '오픈소스', '온라인', '플랫폼', 'cpu', '무선', 'ssd', '아마존', '솔루션', '하드웨어', '인터넷', '미국', 'ios', '메모리', 'amd', 'ai', '컴퓨터', '운영체제', '웹', '오피스', '노트북', '인공지능', '3d', '멜트다운', '머신러닝']

for line in sys.stdin:
    line = line.strip().lower() # 영어를 소문자로 만듦
    words = line.split()

    for word in words:
        for f in filtering:
            if word.find(f) != -1:  # 필터링 문자에 걸렸을 때
                print("{}\t1".format(f))
                break   #스마트폰과 스마트가 있으므로 스마트폰이 먼저 검색되고나면 멈춰야함.